Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd
s=pd.Series([4,8,15,16,23,42])
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
a=[2,4,5,6,7,33,43,67,12,78]
import pandas as pd
ls=pd.Series(a)
ls

0     2
1     4
2     5
3     6
4     7
5    33
6    43
7    67
8    12
9    78
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [6]:
import pandas as pd
df=pd.DataFrame([("Alice",25,"Female"),
                ("Bob",30,"Male"),
                ("Claire",27,"Female"),
                ],
                columns=("Name","Age","Gender"))

In [7]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans.
pd.Series is a one-dimensional object in pandas which contains can hold homogeneous data type objects in it.

pd.DataFrame is a two-dimensional object in pandas which can hold multiple series at a time and manupulate its data.

In [8]:
# Pandas Series

series = pd.Series([5, 34, 45, 242, 45, 12, 1, 0, 214, 45])

df = pd.DataFrame({
    'Name': ['Anshul', 'Raj', 'Prateek', 'Ashu'],
    'Age': [18, 16, 28, 28]
})

print(series)
df

0      5
1     34
2     45
3    242
4     45
5     12
6      1
7      0
8    214
9     45
dtype: int64

      Name  Age
0   Anshul   18
1      Raj   16
2  Prateek   28
3     Ashu   28

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Ans.Some common functions in pandas dataframe are

pd.DataFrame.describe() is used to see the summary of the numerical columns in the dataframe.

pd.DataFrame.shape gives the dimension of the dataset.

pd.head(): In Pandas, df.head(n) is a method of a DataFrame object that returns the first n rows of the DataFrame

df.dtypes: returns the data type of all the columns in a dataframe

df.tail(): In Pandas, df.tail(n) is a method of a DataFrame object that returns the last n rows of the DataFrame

df.info(): prints a summary of the DataFrame, including the data types and non-null values of each column.

In [10]:
print(df.shape)
df.describe()

(4, 2)

             Age
count   4.000000
mean   22.500000
std     6.403124
min    16.000000
25%    17.500000
50%    23.000000
75%    28.000000
max    28.000000

In [11]:
df.head(3)

      Name  Age
0   Anshul   18
1      Raj   16
2  Prateek   28

In [12]:
df.tail(2)

      Name  Age
2  Prateek   28
3     Ashu   28

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [16]:
df.dtypes

Name    object
Age      int64
dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. Pandas Series, DataFrame and Panel: all of them are mutable but panel has been deprecated and is no longer recommended for use.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series(['a', 'b', 'c'])
s3 = pd.Series([10.5, 20.5, 30.5])
df = pd.DataFrame({'col1': s1, 'col2': s2, 'col3': s3})
df

   col1 col2  col3
0     1    a  10.5
1     2    b  20.5
2     3    c  30.5